tunguyendeleter/TuNN41_embedded/UARTAssignment_NguyenNgocTu/S32K/lpit.h
/******************************************************************************
 * Project Name: LPUART DRIVER
 * File Name:   lpit.h
 *
 * Description: Implementation of the LPIT
 *              Target systems:           S32K144
 *              Derivatives:              ARM Cortex-M4
 *              Compiler:                 S32DS
 *
 *****************************************************************************/
#ifndef DRIVERS_INC_LPIT_H_
#define DRIVERS_INC_LPIT_H_

/******************************************************************************
 *  INCLUDES
 *****************************************************************************/
#include "S32K144xx.h"

/******************************************************************************
 *  DEFINES & MACROS
 *****************************************************************************/
/**
 * @brief    Define LPIT MCR Module Enable
 */
#define LPIT_MCR_M_CEN_MASK                      0x1u
#define LPIT_MCR_M_CEN_SHIFT                     0u
#define LPIT_MCR_M_CEN_WIDTH                     1u

/**
 * @brief    Define LPIT MCR Debug Run Enable
 */
#define LPIT_MCR_DBG_EN_MASK                     0x8u
#define LPIT_MCR_DBG_EN_SHIFT                    3u
#define LPIT_MCR_DBG_EN_WIDTH                    1u

/**
 * @brief    Define LPIT MIER 0 Interrupt Enable
 */
#define LPIT_MIER_TIE0_MASK                      0x1u
#define LPIT_MIER_TIE0_SHIFT                     0u
#define LPIT_MIER_TIE0_WIDTH                     1u

/**
 * @brief    Define LPIT MIER 1 Interrupt Enable 
 */
#define LPIT_MIER_TIE1_MASK                      0x2u
#define LPIT_MIER_TIE1_SHIFT                     1u
#define LPIT_MIER_TIE1_WIDTH                     1u

/**
 * @brief    Define LPIT MIER 2 Interrupt Enable
 */
#define LPIT_MIER_TIE2_MASK                      0x4u
#define LPIT_MIER_TIE2_SHIFT                     2u
#define LPIT_MIER_TIE2_WIDTH                     1u

/**
 * @brief    Define LPIT MIER 3 Interrupt Enable
 */
#define LPIT_MIER_TIE3_MASK                      0x8u
#define LPIT_MIER_TIE3_SHIFT                     3u
#define LPIT_MIER_TIE3_WIDTH                     1u

/******************************************************************************
 *  TYPEDEFS
 *****************************************************************************/

/******************************************************************************
 *  GLOBAL FUNCTION PROTOTYPE
 *****************************************************************************/
/**
* @brief  This function configures LPIT module
*/
extern void LPIT_CH0_Init(uint32 CountValue);

/**
* @brief  This function enable LPIT module
*/
extern void LPIT_StartTimer(uint8 Channel);

/**
* @brief  This function stop LPIT module
*/
extern void LPIT_StopTimer(uint8 Channel);



#endif /* DRIVERS_INC_LPIT_H_ */